In [1]:
import pandas as pd
import numpy as np

In [11]:
ave_data=np.array(np.arange(24)).reshape((6,4))
dates=pd.date_range('20210101', periods=6)
ave_df=pd.DataFrame(ave_data, index=dates, columns=list('1234'))
ave_df

             1   2   3   4
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19
2021-01-06  20  21  22  23

In [9]:
ave_df['4']

2021-01-01     3
2021-01-02     7
2021-01-03    11
2021-01-04    15
2021-01-05    19
2021-01-06    23
Freq: D, Name: 4, dtype: int32

In [12]:
ave_df[1:4]

             1   2   3   4
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15

In [13]:
ave_df[1:3]

            1  2   3   4
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [15]:
ave_df['2021-01-01':'2021-01-05']

             1   2   3   4
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19

In [16]:
ave_df.loc[dates[1:5]]

             1   2   3   4
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19

In [18]:
ave_df.loc[:,['1','3']]

             1   3
2021-01-01   0   2
2021-01-02   4   6
2021-01-03   8  10
2021-01-04  12  14
2021-01-05  16  18
2021-01-06  20  22

In [19]:
ave_df.loc['2021-01-01':'2021-01-03',['1','3']]

            1   3
2021-01-01  0   2
2021-01-02  4   6
2021-01-03  8  10

In [20]:
ave_df.loc['2021-01-01',['1','3']][1]*5

10

In [21]:
ave_df.loc['2021-01-02',['1','3']][0]*5

20

In [22]:
ave_df.loc[dates[1],'1']

4

In [24]:
ave_data[2]

array([ 8,  9, 10, 11])

In [25]:
ave_df.iloc[2]

1     8
2     9
3    10
4    11
Name: 2021-01-03 00:00:00, dtype: int32

In [27]:
ave_df.iloc[1:3,2:5]

             3   4
2021-01-02   6   7
2021-01-03  10  11

In [28]:
ave_df.iloc[[0,1,3],[0,2]]

             1   3
2021-01-01   0   2
2021-01-02   4   6
2021-01-04  12  14

In [29]:
ave_df.iloc[1:3,:]

            1  2   3   4
2021-01-02  4  5   6   7
2021-01-03  8  9  10  11

In [30]:
ave_df.iloc[:,1:3]

             2   3
2021-01-01   1   2
2021-01-02   5   6
2021-01-03   9  10
2021-01-04  13  14
2021-01-05  17  18
2021-01-06  21  22

In [31]:
ave_df[ave_df>=5]

               1     2     3     4
2021-01-01   NaN   NaN   NaN   NaN
2021-01-02   NaN   5.0   6.0   7.0
2021-01-03   8.0   9.0  10.0  11.0
2021-01-04  12.0  13.0  14.0  15.0
2021-01-05  16.0  17.0  18.0  19.0
2021-01-06  20.0  21.0  22.0  23.0

In [33]:
start_date='20210101'
ave_numpy_data=np.array(np.arange(40)).reshape((10,4))
dates=pd.date_range(start_date,periods=10)
ave_df=pd.DataFrame(ave_numpy_data, index=dates, columns=list('ABCD'))
ave_df

             A   B   C   D
2021-01-01   0   1   2   3
2021-01-02   4   5   6   7
2021-01-03   8   9  10  11
2021-01-04  12  13  14  15
2021-01-05  16  17  18  19
2021-01-06  20  21  22  23
2021-01-07  24  25  26  27
2021-01-08  28  29  30  31
2021-01-09  32  33  34  35
2021-01-10  36  37  38  39

In [35]:
ave_df_cars=ave_df.copy()
ave_df_cars['Cars']=['Ford','Opel','Mazda','Mitsubishi','Renault','Lada','Hammer','BMW',
                     'Mercedes','VW']
ave_df_cars

             A   B   C   D        Cars
2021-01-01   0   1   2   3        Ford
2021-01-02   4   5   6   7        Opel
2021-01-03   8   9  10  11       Mazda
2021-01-04  12  13  14  15  Mitsubishi
2021-01-05  16  17  18  19     Renault
2021-01-06  20  21  22  23        Lada
2021-01-07  24  25  26  27      Hammer
2021-01-08  28  29  30  31         BMW
2021-01-09  32  33  34  35    Mercedes
2021-01-10  36  37  38  39          VW

In [36]:
pd.date_range(start_date,periods=10)

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [37]:
pd.Series([1,2,3,4,5,6,7,8,9,10], index=pd.date_range(start_date,periods=10))

2021-01-01     1
2021-01-02     2
2021-01-03     3
2021-01-04     4
2021-01-05     5
2021-01-06     6
2021-01-07     7
2021-01-08     8
2021-01-09     9
2021-01-10    10
Freq: D, dtype: int64

In [39]:
ave_series=pd.Series([1,2,3,4,5,6,7,8,9,10], index=pd.date_range(start_date, periods=10))
ave_df_cars['Extra']=ave_series*10+2
ave_df_cars

             A   B   C   D        Cars  Extra
2021-01-01   0   1   2   3        Ford     12
2021-01-02   4   5   6   7        Opel     22
2021-01-03   8   9  10  11       Mazda     32
2021-01-04  12  13  14  15  Mitsubishi     42
2021-01-05  16  17  18  19     Renault     52
2021-01-06  20  21  22  23        Lada     62
2021-01-07  24  25  26  27      Hammer     72
2021-01-08  28  29  30  31         BMW     82
2021-01-09  32  33  34  35    Mercedes     92
2021-01-10  36  37  38  39          VW    102

In [42]:
ave_df_cars.at[dates[4],'Cars']='Citroen'

In [43]:
ave_df_cars

             A   B   C   D        Cars  Extra
2021-01-01   0   1   2   3        Ford     12
2021-01-02   4   5   6   7        Opel     22
2021-01-03   8   9  10  11       Mazda     32
2021-01-04  12  13  14  15  Mitsubishi     42
2021-01-05  16  17  18  19     Citroen     52
2021-01-06  20  21  22  23        Lada     62
2021-01-07  24  25  26  27      Hammer     72
2021-01-08  28  29  30  31         BMW     82
2021-01-09  32  33  34  35    Mercedes     92
2021-01-10  36  37  38  39          VW    102

In [44]:
ave_df_cars.iat[3,2]=666

In [45]:
ave_df_cars

             A   B    C   D        Cars  Extra
2021-01-01   0   1    2   3        Ford     12
2021-01-02   4   5    6   7        Opel     22
2021-01-03   8   9   10  11       Mazda     32
2021-01-04  12  13  666  15  Mitsubishi     42
2021-01-05  16  17   18  19     Citroen     52
2021-01-06  20  21   22  23        Lada     62
2021-01-07  24  25   26  27      Hammer     72
2021-01-08  28  29   30  31         BMW     82
2021-01-09  32  33   34  35    Mercedes     92
2021-01-10  36  37   38  39          VW    102

In [46]:
ave_df_cars.iat[4,2]=666

In [47]:
ave_df_cars

             A   B    C   D        Cars  Extra
2021-01-01   0   1    2   3        Ford     12
2021-01-02   4   5    6   7        Opel     22
2021-01-03   8   9   10  11       Mazda     32
2021-01-04  12  13  666  15  Mitsubishi     42
2021-01-05  16  17  666  19     Citroen     52
2021-01-06  20  21   22  23        Lada     62
2021-01-07  24  25   26  27      Hammer     72
2021-01-08  28  29   30  31         BMW     82
2021-01-09  32  33   34  35    Mercedes     92
2021-01-10  36  37   38  39          VW    102

In [48]:
ave_new_array=np.array(np.arange(len(ave_df_cars)))*10+5

In [49]:
ave_new_array

array([ 5, 15, 25, 35, 45, 55, 65, 75, 85, 95])

In [50]:
ave_df_cars['E']=ave_new_array

In [51]:
ave_df_cars

             A   B    C   D        Cars  Extra   E
2021-01-01   0   1    2   3        Ford     12   5
2021-01-02   4   5    6   7        Opel     22  15
2021-01-03   8   9   10  11       Mazda     32  25
2021-01-04  12  13  666  15  Mitsubishi     42  35
2021-01-05  16  17  666  19     Citroen     52  45
2021-01-06  20  21   22  23        Lada     62  55
2021-01-07  24  25   26  27      Hammer     72  65
2021-01-08  28  29   30  31         BMW     82  75
2021-01-09  32  33   34  35    Mercedes     92  85
2021-01-10  36  37   38  39          VW    102  95

In [54]:
laptops=['Lenovo','Dell','HP','Chromebook','Macbook']
laptops_df=pd.DataFrame({
    'price':[350,400,500,560,1000],
    'dist_space':[0.5,1,2,3,1.5]},
    index=laptops)

In [55]:
laptops_df

            price  dist_space
Lenovo        350         0.5
Dell          400         1.0
HP            500         2.0
Chromebook    560         3.0
Macbook      1000         1.5

In [56]:
more_laptops=['Lenovo','Dell','HP','Huawei','Macbook']
laptops_df_2=laptops_df.reindex(more_laptops)

In [57]:
laptops_df_2

          price  dist_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
Huawei      NaN         NaN
Macbook  1000.0         1.5

In [58]:
laptops_df_3=laptops_df_2.dropna(how='any')

In [59]:
laptops_df_3

          price  dist_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
Macbook  1000.0         1.5

In [60]:
laptops_df_2.fillna(value=100)

          price  dist_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
Huawei    100.0       100.0
Macbook  1000.0         1.5

In [61]:
pd.isnull(laptops_df_2)

         price  dist_space
Lenovo   False       False
Dell     False       False
HP       False       False
Huawei    True        True
Macbook  False       False

In [62]:
laptops_df_2*10

           price  dist_space
Lenovo    3500.0         5.0
Dell      4000.0        10.0
HP        5000.0        20.0
Huawei       NaN         NaN
Macbook  10000.0        15.0

In [64]:
pd.set_option('display.precision',2)
laptops_df_2.describe()

         price  dist_space
count     4.00        4.00
mean    562.50        1.25
std     298.26        0.65
min     350.00        0.50
25%     387.50        0.88
50%     450.00        1.25
75%     625.00        1.62
max    1000.00        2.00

In [66]:
laptops_df_2.mean()

price         562.50
dist_space      1.25
dtype: float64

In [67]:
laptops_df_2.mean(1)

Lenovo     175.25
Dell       200.50
HP         251.00
Huawei        NaN
Macbook    500.75
dtype: float64

In [68]:
laptops_df_2.apply(np.cumsum,axis=0)

          price  dist_space
Lenovo    350.0         0.5
Dell      750.0         1.5
HP       1250.0         3.5
Huawei      NaN         NaN
Macbook  2250.0         5.0

In [69]:
pieces=[laptops_df_2[:1], laptops_df_2[1:3], laptops_df_2[3:]]

In [70]:
pieces

[        price  dist_space
 Lenovo  350.0         0.5,
       price  dist_space
 Dell  400.0         1.0
 HP    500.0         2.0,
           price  dist_space
 Huawei      NaN         NaN
 Macbook  1000.0         1.5]

In [71]:
new_list=pieces[0],pieces[2]
pd.concat(new_list)

          price  dist_space
Lenovo    350.0         0.5
Huawei      NaN         NaN
Macbook  1000.0         1.5

In [72]:
new_last_row=laptops_df_2.iloc[2]

In [73]:
laptops_df_2.append(new_last_row)

          price  dist_space
Lenovo    350.0         0.5
Dell      400.0         1.0
HP        500.0         2.0
Huawei      NaN         NaN
Macbook  1000.0         1.5
HP        500.0         2.0

In [74]:
left=pd.DataFrame({'my_key': ['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

right=pd.DataFrame({'my_key': ['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})

In [75]:
result=pd.merge(left,right,on='my_key')

In [76]:
result

  my_key   A   B   C   D
0     K0  A0  B0  C0  D0
1     K1  A1  B1  C1  D1
2     K2  A2  B2  C2  D2
3     K3  A3  B3  C3  D3

In [77]:
bank_df=pd.read_csv(r"C:\Users\German\Desktop\bank.csv")

In [78]:
print(bank_df.head(100))

   age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0   30;"unemployed";"married";"primary";"no";1787;...
1   33;"services";"married";"secondary";"no";4789;...
2   35;"management";"single";"tertiary";"no";1350;...
3   30;"management";"married";"tertiary";"no";1476...
4   59;"blue-collar";"married";"secondary";"no";0;...
..                                                ...
95  41;"unknown";"single";"tertiary";"no";1567;"no...
96  41;"admin.";"married";"tertiary";"no";5426;"ye...
97  30;"admin.";"single";"tertiary";"no";261;"no";...
98  36;"blue-collar";"divorced";"secondary";"no";2...
99  31;"unemployed";"single";"primary";"no";406;"n...

[100 rows x 1 columns]

In [84]:
retail_file='C:\\Users\German\Desktop\Online Retail.xlsx'

In [85]:
online_retail_df=pd.read_excel(retail_file, 'Online Retail', index_col=None, na_values=['NA'])

In [86]:
online_retail_df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [87]:
online_retail_df.groupby('Quantity').sum()

          UnitPrice  CustomerID
Quantity
-80995         2.08     16446.0
-74215         1.04     12346.0
-9600          0.00         0.0
-9360          0.03     15838.0
-9058          0.00         0.0
...             ...         ...
 4800          0.21     12901.0
 5568          0.00         0.0
 12540         0.00     13256.0
 74215         1.04     12346.0
 80995         2.08     16446.0

[722 rows x 2 columns]

In [88]:
online_retail_df.groupby('Country').count()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID
Country,,,,,,,
Australia,1259,1259,1259,1259,1259,1259,1259
Austria,401,401,401,401,401,401,401
Bahrain,19,19,19,19,19,19,17
Belgium,2069,2069,2069,2069,2069,2069,2069
Brazil,32,32,32,32,32,32,32
Canada,151,151,151,151,151,151,151
Channel Islands,758,758,758,758,758,758,758
Cyprus,622,622,622,622,622,622,622
Czech Republic,30,30,30,30,30,30,30
Denmark,389,389,389,389,389,389,389
EIRE,8196,8196,8196,8196,8196,8196,7485
European Community,61,61,61,61,61,61,61
Finland,695,695,695,695,695,695,695
France,8557,8557,8557,8557,8557,8557,8491
Germany,9495,9495,9495,9495,9495,9495,9495
Greece,146,146,146,146,146,146,146
Hong Kong,288,288,288,288,288,288,0
Iceland,182,182,182,182,182,182,182
Israel,297,297,297,297,297,297,250
Italy,803,803,803,803,803,803,803
Japan,358,358,358,358,358,358,358
Lebanon,45,45,45,45,45,45,45
Lithuania,35,35,35,35,35,35,35
Malta,127,127,127,127,127,127,127
Netherlands,2371,2371,2371,2371,2371,2371,2371
Norway,1086,1086,1086,1086,1086,1086,1086
Poland,341,341,341,341,341,341,341
Portugal,1519,1519,1519,1519,1519,1519,1480
RSA,58,58,58,58,58,58,58
Saudi Arabia,10,10,10,10,10,10,10
Singapore,229,229,229,229,229,229,229
Spain,2533,2533,2533,2533,2533,2533,2533
Sweden,462,462,462,462,462,462,462
Switzerland,2002,2002,2002,2002,2002,2002,1877
USA,291,291,291,291,291,291,291
United Arab Emirates,68,68,68,68,68,68,68
United Kingdom,495478,495478,494024,495478,495478,495478,361878
Unspecified,446,446,446,446,446,446,244

In [89]:
ave_index=pd.date_range('1/1/2021',periods=10,freq='min')

In [90]:
ave_index

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:01:00',
               '2021-01-01 00:02:00', '2021-01-01 00:03:00',
               '2021-01-01 00:04:00', '2021-01-01 00:05:00',
               '2021-01-01 00:06:00', '2021-01-01 00:07:00',
               '2021-01-01 00:08:00', '2021-01-01 00:09:00'],
              dtype='datetime64[ns]', freq='T')

In [91]:
ave_series=pd.Series(np.arange(10),index=ave_index)

In [92]:
ave_series

2021-01-01 00:00:00    0
2021-01-01 00:01:00    1
2021-01-01 00:02:00    2
2021-01-01 00:03:00    3
2021-01-01 00:04:00    4
2021-01-01 00:05:00    5
2021-01-01 00:06:00    6
2021-01-01 00:07:00    7
2021-01-01 00:08:00    8
2021-01-01 00:09:00    9
Freq: T, dtype: int32

In [93]:
ave_series.resample('5min').sum()

2021-01-01 00:00:00    10
2021-01-01 00:05:00    35
Freq: 5T, dtype: int32

In [94]:
ave_series.resample('5min',label='right').sum()

2021-01-01 00:05:00    10
2021-01-01 00:10:00    35
Freq: 5T, dtype: int32

In [95]:
ave_series.resample('5min',label='right',closed='right').sum()

2021-01-01 00:00:00     0
2021-01-01 00:05:00    15
2021-01-01 00:10:00    30
Freq: 5T, dtype: int32

In [96]:
ave_series.resample('30S').asfreq()[0:5]

2021-01-01 00:00:00    0.0
2021-01-01 00:00:30    NaN
2021-01-01 00:01:00    1.0
2021-01-01 00:01:30    NaN
2021-01-01 00:02:00    2.0
Freq: 30S, dtype: float64

In [98]:
def custom_math(array_like):
    temp=3*np.sum(array_like)+10
    return temp

In [99]:
ave_series.resample('3min').apply(custom_math)

2021-01-01 00:00:00    19
2021-01-01 00:03:00    46
2021-01-01 00:06:00    73
2021-01-01 00:09:00    37
Freq: 3T, dtype: int64

In [100]:
ave_simple_series=pd.Series(np.random.randn(5), index=['A','B','C','D','E'])

In [101]:
ave_simple_series

A    0.23
B    1.03
C   -0.14
D    0.99
E    0.80
dtype: float64

In [102]:
ave_simple_series=pd.Series(np.random.randn(5))

In [103]:
ave_simple_series

0    0.11
1    1.05
2   -0.87
3   -0.87
4    0.11
dtype: float64

In [104]:
ave_simple_series[:3]

0    0.11
1    1.05
2   -0.87
dtype: float64

In [106]:
ave_dictionary={'A':30, 'B': -5.8, 'C': 666}
ave_another_series=pd.Series(ave_dictionary)

In [107]:
ave_another_series

A     30.0
B     -5.8
C    666.0
dtype: float64

In [108]:
ave_another_series['B']

-5.8

In [109]:
pd.Series(ave_dictionary, index=['D','C','B','E'])

D      NaN
C    666.0
B     -5.8
E      NaN
dtype: float64

In [110]:
ave_another_series.get('A')

30.0

In [111]:
pd.Series(5., index=['A', 'B', 'C', 'D', 'E'])

A    5.0
B    5.0
C    5.0
D    5.0
E    5.0
dtype: float64

In [112]:
ave_simple_series+ave_simple_series

0    0.21
1    2.11
2   -1.74
3   -1.75
4    0.22
dtype: float64

In [113]:
ave_simple_series

0    0.11
1    1.05
2   -0.87
3   -0.87
4    0.11
dtype: float64

In [114]:
ave_simple_series+100

0    100.11
1    101.05
2     99.13
3     99.13
4    100.11
dtype: float64

In [115]:
ave_simple_series*5

0    0.53
1    5.27
2   -4.34
3   -4.37
4    0.55
dtype: float64

In [116]:
np.exp(ave_simple_series)

0    1.11
1    2.87
2    0.42
3    0.42
4    1.12
dtype: float64

In [117]:
ave_simple_series[1:]

1    1.05
2   -0.87
3   -0.87
4    0.11
dtype: float64

In [118]:
ave_simple_series[:-1]

0    0.11
1    1.05
2   -0.87
3   -0.87
dtype: float64

In [119]:
ave_simple_series[1:]+ave_simple_series[:-1]

0     NaN
1    2.11
2   -1.74
3   -1.75
4     NaN
dtype: float64

In [120]:
def mult_by_ten(input_element):
    return input_element*10.0

In [121]:
ave_simple_series.map(mult_by_ten)

0     1.05
1    10.53
2    -8.68
3    -8.74
4     1.09
dtype: float64

In [122]:
series_of_random_stuff=pd.Series(['A','B','C','Abracadabra','Boba',np.nan,'DOG',
                                  'Cow','Helicopter'])

In [123]:
series_of_random_stuff.str.lower()

0              a
1              b
2              c
3    abracadabra
4           boba
5            NaN
6            dog
7            cow
8     helicopter
dtype: object

In [124]:
ave_dictionary={'A':20, 'B':-20, 'C':666}

In [125]:
print(ave_dictionary.keys())

dict_keys(['A', 'B', 'C'])

In [126]:
print(ave_dictionary.values())

dict_values([20, -20, 666])

In [128]:
ave_dictionary_df=pd.DataFrame(ave_dictionary, index=['start','finish'])

In [129]:
ave_dictionary_df

         A   B    C
start   20 -20  666
finish  20 -20  666

In [131]:
book_df=pd.DataFrame({'AAA':[4,5,6,7], 'BBB':[10,20,30,40], 'CCC':[100,50,-30,-50]})

In [133]:
series_dictionary={'one':pd.Series([1.,2.,3.], index=['a', 'b', 'c']),
                  'two':pd.Series([1.,2.,3.,4.], index=['a', 'b', 'c', 'd'])}

In [134]:
series_df=pd.DataFrame(series_dictionary)

In [135]:
series_df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [136]:
fresh_stuff={'vegetables': ['onion', 'courgette', 'aubergine', 'pepper'],
            'fruit':['apple', 'pear', 'persimon', 'plum']}

In [137]:
fresh_stuff

{'vegetables': ['onion', 'courgette', 'aubergine', 'pepper'],
 'fruit': ['apple', 'pear', 'persimon', 'plum']}

In [138]:
some_data=[{'a':1, 'b':2}, {'a':5, 'b':10, 'c':10}]

In [139]:
pd.DataFrame(some_data)

   a   b     c
0  1   2   NaN
1  5  10  10.0